# VertexIndexPair Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexIndexPair Constructor
VertexIndexPair Class See Also
---
Initializes a new instance of the VertexIndexPair class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public VertexIndexPair(
	int iTop,
	int iBottom
)
```

Visual Basic
---
```text
Public Sub New ( _
	iTop As Integer, _
	iBottom As Integer _
)
```

Visual C++
---
```text
public:
VertexIndexPair(
	int iTop,
	int iBottom
)
```

# ### Parameters
iTop
    Type: System..::..Int32
iBottom
    Type: System..::..Int32
# See Also
VertexIndexPair Class
Autodesk.Revit.DB Namespace